# Все .c файлы в текущей директории
SRCS = $(wildcard *.c)
# Соответствующие .o файлы
OBJS = $(SRCS:.c=.o)

all: $(OBJS)

%.o: %.c
	clang -O2 -Wall -target bpf -I/usr/include/$(shell uname -r) -I/usr/include/x86_64-linux-gnu -c $< -o $@

clean:
	rm -f *.o

# $< – автоматическая переменная, подставляющая имя первой зависимости (в данном случае .c-файл).
# $@ – автоматическая переменная, подставляющая имя цели (в данном случае .o-файл).
# $(shell uname -r) – вызов shell-команды для получения версии ядра.